/** @file


  Copyright (c) 2013 - 2014, Intel Corporation. All rights reserved.<BR>

  This program and the accompanying materials
  are licensed and made available under the terms and conditions of the BSD License
  which accompanies this distribution.  The full text of the license may be found at
  http://opensource.org/licenses/bsd-license.php.

  THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
  WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.

**/

#langdef en-US "English"

#string STR_TOOLS_INVALID_INPUT            #language en-US  "LongRunShellTool: Invalid input, please type 'LongRunShellTool /?'for help\n"

#string STR_TOOLS_HELP2                    #language en-US  "                                                                               \n"
                                                            "-cr   ColdReset                                                                \n"
                                                            "-wr   WarmReset                                                                \n"
                                                            "-sr   ShutdownReset                                                            \n"
                                                            "-pcr  PowerCycleReset   <EfiResetPlatformSpecific, unsupported>                \n"
                                                            "-gr   GlobalReset       <EfiResetPlatformSpecific, unsupported>                \n"
                                                            "-gre  GlobalResetWithEc <EfiResetPlatformSpecific, unsupported>                \n"
                                                            "                                                                               \n"
                                                            "-t xx     Delay xx seconds to action                                           \n"
                                                            "-a 0x1800 PMBASE ACPI Base Address                                             \n"
                                                            "-s xx     SetWakeupTime after xx seconds                                       \n"

#string STR_GEN_NO_VALUE                   #language en-US "%EError. %NThe argument '%B%s%N' requires a value.\r\n"
#string STR_GEN_PROBLEM_VAL                #language en-US "%EError. %NThe argument '%B%s%N' has incorrect value.\r\n"
#string STR_GEN_TOO_FEW                    #language en-US "%EError. %NToo few arguments specified.\r\n"